# Import and Export Files

# Challenge 0 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:
# libraries

import mysql.connector # to establish a connection from python to mysql
import getpass 

import pandas as pd

In [2]:
password = getpass.getpass() # watchout: can give-away the password with a print

········

In [23]:
cnx = mysql.connector.connect(user = "root",
                              password = password,
                              host = "localhost",
                              database = "sakila")

cnx.is_connected()

True

In [24]:
cursor = cnx.cursor()

In [25]:
# query that will return all contents of the sakila customer table

query = ('''SELECT * FROM customer;''')

cursor.execute(query)

result = cursor.fetchall()

In [26]:
customers = pd.DataFrame(result, columns = [header[0] for header in cursor.description])
customers.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [27]:
# query that will return a join of the customer and rental tables

query = ('''SELECT customer.customer_id, customer.first_name, customer.last_name, 
            rental.rental_id, rental.rental_date, rental.return_date
            FROM customer
            JOIN rental ON customer.customer_id = rental.customer_id;''')

cursor.execute(query)

result = cursor.fetchall()

In [28]:
customers_rentals = pd.DataFrame(result, columns = [header[0] for header in cursor.description])
customers_rentals.head()

,customer_id,first_name,last_name,rental_id,rental_date,return_date
0,1,MARY,SMITH,76,2005-05-25 11:30:37,2005-06-03 12:00:37
1,1,MARY,SMITH,573,2005-05-28 10:35:23,2005-06-03 06:32:23
2,1,MARY,SMITH,1185,2005-06-15 00:54:12,2005-06-23 02:42:12
3,1,MARY,SMITH,1422,2005-06-15 18:02:53,2005-06-19 15:54:53
4,1,MARY,SMITH,1476,2005-06-15 21:08:46,2005-06-25 02:26:46

In [29]:
# query that will return a join of the actors and films (through film_actor)

query = ('''SELECT * 
            FROM actor
            INNER JOIN film_actor
            ON film_actor.actor_id = actor.actor_id
            INNER JOIN film
            ON film.film_id = film_actor.film_id;''')

cursor.execute(query)

result = cursor.fetchall()

In [30]:
actors_films = pd.DataFrame(result, columns = [header[0] for header in cursor.description])
actors_films.head()

,actor_id,first_name,last_name,last_update,actor_id,film_id,last_update,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,PENELOPE,GUINESS,2006-02-15 04:34:33,1,1,2006-02-15 05:05:03,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42
1,1,PENELOPE,GUINESS,2006-02-15 04:34:33,1,23,2006-02-15 05:05:03,23,ANACONDA CONFESSIONS,A Lacklusture Display of a Dentist And a Denti...,2006,1,None,3,0.99,92,9.99,R,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
2,1,PENELOPE,GUINESS,2006-02-15 04:34:33,1,25,2006-02-15 05:05:03,25,ANGELS LIFE,A Thoughtful Display of a Woman And a Astronau...,2006,1,None,3,2.99,74,15.99,G,{Trailers},2006-02-15 05:03:42
3,1,PENELOPE,GUINESS,2006-02-15 04:34:33,1,106,2006-02-15 05:05:03,106,BULWORTH COMMANDMENTS,A Amazing Display of a Mad Cow And a Pioneer w...,2006,1,None,4,2.99,61,14.99,G,{Trailers},2006-02-15 05:03:42
4,1,PENELOPE,GUINESS,2006-02-15 04:34:33,1,140,2006-02-15 05:05:03,140,CHEAPER CLYDE,A Emotional Character Study of a Pioneer And a...,2006,1,None,6,0.99,87,23.99,G,"{Behind the Scenes, Commentaries, Trailers}",2006-02-15 05:03:42

# Challenge 1 - Working with JSON files
Import the pandas library.

In [31]:
# libraries

import pandas as pd

In the next cell, load the data in nasa.json in the data folder and load it into a pandas dataframe. Name the dataframe nasa.

In [32]:
nasa = pd.read_json("nasa.json")

Now that we have loaded the data, let's examine it using the head() function.

In [33]:
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

####  The value_counts() function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the value_counts() function to determine the frequency of all types of asteroid landings by applying the function to the fall column.

In [34]:
nasa["fall"].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the orient=records argument and name the file nasa-output.json. Remember to save the file inside the data folder.

In [35]:
nasa_output = nasa.to_json("nasa-output.json", orient="records")

# Challenge 2 - Working with CSV and Other Separated Files

Import the pandas library

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [36]:
# libraries

import pandas as pd

In [37]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [38]:
shuttle = pd.read_csv(tst_url, sep = " ", names = cols)

Let's verify that this worked by looking at the `head()` function.

In [41]:
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [42]:
shuttle.to_csv("shuttle.csv", index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [43]:
# libraries

import pandas as pd

In [44]:
astronaut = pd.read_excel("astronauts.xls")

Use the `head()` function to inspect the dataframe.

In [41]:
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [45]:
astronaut['Undergraduate Major'].value_counts()

Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Astronomy                                 1
Marine Engineering & Nautical Science     1
Philosophy                                1
Bioscience                                1
Military Science                          1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [46]:
astronaut.to_csv("astronaut.csv", sep ="\t", index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [53]:
import pandas as pd
import zipfile

# extract the contents of the zip file
with zipfile.ZipFile('fertility.zip', 'r') as zip_ref:
    zip_ref.extractall()

# obtain the column names from the url
columns = ["Season in which the analysis was performed.", 
           "Age at the time of analysis.", 
           "Childish diseases (ie , chicken pox, measles, mumps, polio)", 
           "Accident or serious trauma", 
           "Surgical intervention", 
           "High fevers in the last year", 
           "Frequency of alcohol consumption", 
           "Smoking habit", 
           "Number of hours spent sitting per day", 
           "Output: Diagnosis"]

# combine the file in a df
fertility = pd.read_csv("fertility_Diagnosis.txt", names=columns)

fertility.head()

,Season in which the analysis was performed.,Age at the time of analysis.,"Childish diseases (ie , chicken pox, measles, mumps, polio)",Accident or serious trauma,Surgical intervention,High fevers in the last year,Frequency of alcohol consumption,Smoking habit,Number of hours spent sitting per day,Output: Diagnosis
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O